MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_i3c.h
  * @brief   Header file of I3C HAL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_HAL_I3C_H
#define STM32C5XX_HAL_I3C_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_i3c.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined (I3C1)

/** @defgroup I3C I3C
  * @{
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup I3C_Exported_Constants HAL I3C constants
  * @{
  */

/** @defgroup I3C_ERROR_CODE_DEFINITION Error code definition
  * @{
  */
#define HAL_I3C_ERROR_NONE            (0x00000000U) /*!< 0x0
                                      No error */

#define HAL_I3C_CTRL_ERROR_0          (LL_I3C_CONTROLLER_ERROR_CE0 | I3C_SER_PERR) /*!< 0x10 \
                                      Controller detected an illegally formatted CCC */

#define HAL_I3C_CTRL_ERROR_1          (LL_I3C_CONTROLLER_ERROR_CE1 | I3C_SER_PERR) /*!< 0x11 \
                                      Controller detected that transmitted data on the bus is different from expected */

#define HAL_I3C_CTRL_ERROR_2          (LL_I3C_CONTROLLER_ERROR_CE2 | I3C_SER_PERR) /*!< 0x12 \
                                      Controller detected an unacknowledged broadcast address 7'h7E  */

#define HAL_I3C_CTRL_ERROR_3          (LL_I3C_CONTROLLER_ERROR_CE3 | I3C_SER_PERR) /*!< 0x13
                                      Controller detected the new controller did not drive bus after controller-role
                                      hand-off */

#define HAL_I3C_TGT_ERROR_0           (LL_I3C_TARGET_ERROR_TE0 | I3C_SER_PERR) /*!< 0x18 \
                                      Target detected an invalid broadcast address 7'h7E + W */

#define HAL_I3C_TGT_ERROR_1           (LL_I3C_TARGET_ERROR_TE1 | I3C_SER_PERR) /*!< 0x19 \
                                      Target detected a parity error on a CCC code via a parity check (vs. T bit) */

#define HAL_I3C_TGT_ERROR_2           (LL_I3C_TARGET_ERROR_TE2 | I3C_SER_PERR) /*!< 0x1A \
                                      Target detected a parity error on a write data via a parity check (vs. T bit) */

#define HAL_I3C_TGT_ERROR_3           (LL_I3C_TARGET_ERROR_TE3 | I3C_SER_PERR) /*!< 0x1B \
                                      Target detected a parity error on the assigned address during dynamic address \
                                      arbitration via a parity check (vs. PAR bit) */

#define HAL_I3C_TGT_ERROR_4           (LL_I3C_TARGET_ERROR_TE4 | I3C_SER_PERR) /*!< 0x1C \
                                      Target detected a 7'h7E + R missing after Sr during dynamic address arbitration */

#define HAL_I3C_TGT_ERROR_5           (LL_I3C_TARGET_ERROR_TE5 | I3C_SER_PERR) /*!< 0x1D \
                                      Target detected an illegally formatted CCC */

#define HAL_I3C_TGT_ERROR_6           (LL_I3C_TARGET_ERROR_TE6 | I3C_SER_PERR) /*!< 0x1E \
                                      Target detected that transmitted data on the bus is different from expected */

#define HAL_I3C_TGT_ERROR_STALL       LL_I3C_SER_STALL /*!< 0x20 \
                                      Target detected that SCL was stable for more than 125 microsecond during \
                                      an I3C SDR data read (during a direct CCC read, a private read, or an IB) */

#define HAL_I3C_ERROR_DOVR            LL_I3C_SER_DOVR /*!< 0x40 \
                                      Rx FIFO over-run or Tx FIFO under-run */

#define HAL_I3C_ERROR_COVR            LL_I3C_SER_COVR /*!< 0x80 \
                                      S FIFO over-run or C FIFO under-run */

#define HAL_I3C_ERROR_ADDRESS_NACK    LL_I3C_SER_ANACK /*!< 0x100 \
                                      Address not acknowledged */

#define HAL_I3C_ERROR_DATA_NACK       LL_I3C_SER_DNACK /*!< 0x200 \
                                      Data not acknowledged */

#define HAL_I3C_ERROR_DATA_HAND_OFF   LL_I3C_SER_DERR /*!< 0x400 \
                                      Data error during Controller-Role hand-off. Active controller keeps \
                                      controller-role */

#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
#define HAL_I3C_ERROR_DMA             0x00010000U /*!< 0x10000 \
                                      DMA transfer error */
#endif /* USE_HAL_I3C_DMA */

#define HAL_I3C_ERROR_DYNAMIC_ADDR    0x00020000U /*!< 0x20000 \
                                      Dynamic address error */
/**
  * @}
  */


/** @defgroup I3C_CTRL_STALL_FEATURE_DEFINITION Stall feature definition
  * @brief    Optional controller clock stall insertion points on the I3C/I2C bus.
  * @details  Each define enables a programmable pause on a specific protocol phase to allow targets extra
  *           time (e.g. internal processing, data fetch) before the controller continues toggling SCL.
  *           These bits map to timing register fields (TIMINGR2) and must be used sparingly to avoid
  *           throughput degradation.
  * @{
  */
#define HAL_I3C_CTRL_STALL_ACK     LL_I3C_CTRL_STALL_ACK /*!< Inserts a stall after each address or data byte
                                                              ACK/NACK extend target processing time. */

#define HAL_I3C_CTRL_STALL_CCC     LL_I3C_CTRL_STALL_CCC /*!< Inserts a stall on the parity (T) bit phase of a
                                                              direct/broadcast CCC so targets can decode the
                                                              opcode before data phase. */

