MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.h
#define HAL_I3C_CTRL_STALL_TX      LL_I3C_CTRL_STALL_TX  /*!< Inserts a stall on the parity (T) bit of transmitted
                                                              data allowing target additional time to latch received
                                                              byte. */

#define HAL_I3C_CTRL_STALL_RX      LL_I3C_CTRL_STALL_RX  /*!< Inserts a stall before the controller samples target
                                                              data (read path) so target can prepare next byte. */

#define HAL_I3C_CTRL_STALL_I2C_ACK LL_I3C_CTRL_STALL_I2C_ACK /*!< Inserts a stall after address ACK/NACK in legacy I2C
                                                             read/write so target can prepare for next phase. */

#define HAL_I3C_CTRL_STALL_I2C_TX  LL_I3C_CTRL_STALL_I2C_TX  /*!< Inserts a stall after data ACK/NACK in legacy I2C
                                                             write allowing target to process/write incoming byte. */

#define HAL_I3C_CTRL_STALL_I2C_RX  LL_I3C_CTRL_STALL_I2C_RX  /*!< Inserts a stall after data ACK/NACK in legacy I2C
                                                             read allowing target to load the next byte to transmit. */

#define HAL_I3C_CTRL_STALL_ALL     LL_I3C_CTRL_STALL_ALL  /*!< Enable all stall points. */

#define HAL_I3C_CTRL_STALL_NONE    LL_I3C_CTRL_STALL_NONE /*!< Disable all stall insertion (default high throughput). */
/**
  * @}
  */

/**
  * @}
  */

/* Exported types ----------------------------------------------------------------------------------------------------*/
/** @defgroup I3C_Exported_Types HAL I3C Types
  * @{
  */

/**
  * @brief    Communication role (none / Controller / Target).
  */
typedef enum
{
  HAL_I3C_MODE_NONE = 0U,  /*!< No I3C communication ongoing */
  HAL_I3C_MODE_CTRL = 1U,  /*!< I3C communication is in controller Mode */
  HAL_I3C_MODE_TGT  = 2U   /*!< I3C communication is in target Mode */
} hal_i3c_mode_t;

/**
  * @brief    State structure definition.
  */
typedef enum
{
  HAL_I3C_STATE_RESET    = (0UL),        /*!< Not yet Initialized */
  HAL_I3C_STATE_INIT     = (1UL << 31),  /*!< I3C is initialized but not yet configured */
  HAL_I3C_STATE_IDLE     = (1UL << 30),  /*!< I3C initialized and a global config applied */
  HAL_I3C_STATE_TX       = (1UL << 29),  /*!< Data transmission process is ongoing */
  HAL_I3C_STATE_RX       = (1UL << 28),  /*!< Data reception process is ongoing */
  HAL_I3C_STATE_TX_RX    = (1UL << 27),  /*!< Data multiple Transfer process is ongoing */
  HAL_I3C_STATE_DAA      = (1UL << 26),  /*!< Dynamic address assignment process is ongoing */
  HAL_I3C_STATE_TGT_REQ  = (1UL << 25),  /*!< Target request process is ongoing */
  HAL_I3C_STATE_ABORT    = (1UL << 24)   /*!< Abort user request is ongoing */
} hal_i3c_state_t;

/** @defgroup I3C_CTRL_NOTIFICATION Controller notification ID
  * @{
  */
#define HAL_I3C_CTRL_NOTIFICATION_IBI  LL_I3C_IER_IBIIE    /*!< Receive IBI */
#define HAL_I3C_CTRL_NOTIFICATION_CR   LL_I3C_IER_CRIE     /*!< Controller-Role request */
#define HAL_I3C_CTRL_NOTIFICATION_HJ   LL_I3C_IER_HJIE     /*!< Hot-Join */
#define HAL_I3C_CTRL_NOTIFICATION_ALL (LL_I3C_IER_IBIIE | LL_I3C_IER_CRIE | LL_I3C_IER_HJIE) /*!< All notif */
/**
  * @}
  */

/** @defgroup I3C_TGT_NOTIFICATION Target notification ID
  * @{
  */
#define HAL_I3C_TGT_NOTIFICATION_GETACCCR   LL_I3C_IER_CRUPDIE  /*!< Controller-Role hand-off, direct GETACCR CCC */
#define HAL_I3C_TGT_NOTIFICATION_IBIEND     LL_I3C_IER_IBIENDIE /*!< IBI end process */
#define HAL_I3C_TGT_NOTIFICATION_DAU        LL_I3C_IER_DAUPDIE  /*!< Dynamic Address Update: ENTDAA, RSTDAA or SETNEWDA.
  To discriminate RSTDAA from other CCC, call HAL_I3C_GetCCCInfo() and check the field dynamic_addr_valid of
        hal_i3c_ccc_info_t structure */
#define HAL_I3C_TGT_NOTIFICATION_GET_X      LL_I3C_IER_GETIE    /*!< Any direct GETxxx CCC */
#define HAL_I3C_TGT_NOTIFICATION_GET_STATUS LL_I3C_IER_STAIE    /*!< Get status command, direct GETstatus CCC */
#define HAL_I3C_TGT_NOTIFICATION_SETMWL     LL_I3C_IER_MWLUPDIE /*!< Max write length update, direct SETMWL CCC */
#define HAL_I3C_TGT_NOTIFICATION_SETMRL     LL_I3C_IER_MRLUPDIE /*!< Max read length update, direct SETMRL CCC */
#define HAL_I3C_TGT_NOTIFICATION_RSTACT     LL_I3C_IER_RSTIE    /*!< Reset pattern,  broadcast or direct RSTACT CCC */
#define HAL_I3C_TGT_NOTIFICATION_ENTAS_X    LL_I3C_IER_ASUPDIE  /*!< Activity state update, direct or broadcast ENTASx */
#define HAL_I3C_TGT_NOTIFICATION_ENEC_DISEC LL_I3C_IER_INTUPDIE /*!< Receive a direct or broadcast ENEC/DISEC CCC */
#define HAL_I3C_TGT_NOTIFICATION_WKP        LL_I3C_IER_WKPIE    /*!< Wakeup */
#define HAL_I3C_TGT_NOTIFICATION_DEFTGTS    (LL_I3C_IER_DEFIE | LL_I3C_IER_RXFNEIE) /*!< Broadcast  DEFTGTS CCC */
#define HAL_I3C_TGT_NOTIFICATION_DEFGRPA    (LL_I3C_IER_GRPIE | LL_I3C_IER_RXFNEIE) /*!< Group addressing, broadcast
                                                                                         DEFGRPA CCC */
#define HAL_I3C_TGT_NOTIFICATION_ALL  ( \
                                        HAL_I3C_TGT_NOTIFICATION_GETACCCR   | \
                                        HAL_I3C_TGT_NOTIFICATION_IBIEND     | \
                                        HAL_I3C_TGT_NOTIFICATION_DAU        | \
                                        HAL_I3C_TGT_NOTIFICATION_GET_X      | \
                                        HAL_I3C_TGT_NOTIFICATION_GET_STATUS | \
                                        HAL_I3C_TGT_NOTIFICATION_SETMWL     | \
                                        HAL_I3C_TGT_NOTIFICATION_SETMRL     | \
                                        HAL_I3C_TGT_NOTIFICATION_RSTACT     | \
                                        HAL_I3C_TGT_NOTIFICATION_ENTAS_X    | \
                                        HAL_I3C_TGT_NOTIFICATION_ENEC_DISEC | \
                                        HAL_I3C_TGT_NOTIFICATION_WKP        | \
                                        HAL_I3C_TGT_NOTIFICATION_DEFTGTS    | \
                                        HAL_I3C_TGT_NOTIFICATION_DEFGRPA      ) /*!< All notifications */
/**
  * @}
  */

/**
  * @brief  Bitfield encoding message type, stop/restart policy, arbitration header & defining byte.
  *  HAL I3C mode value coding follow below described bitmap:
  *  b31
  *       0: message end type restart
  *       1: message end type stop (I3C_CR_MEND / LL_I3C_GENERATE_STOP)
  *  b30-b29-b28-b27
  *       0010: Private I3C message   (I3C_CR_MTYPE_1 / LL_I3C_CONTROLLER_MTYPE_PRIVATE)
  *       0100: Private I2C message   (I3C_CR_MTYPE_2 / LL_I3C_CONTROLLER_MTYPE_LEGACY_I2C)
  *       0011: CCC direct message    (I3C_CR_MTYPE_1 | I3C_CR_MTYPE_0 / LL_I3C_CONTROLLER_MTYPE_DIRECT)
  *       0110: CCC broadcast message (I3C_CR_MTYPE_2 | I3C_CR_MTYPE_1 / LL_I3C_CONTROLLER_MTYPE_CCC)
  *  b2
  *       1: message without arbitration header (I3C_CFGR_NOARBH)
  *       0: message with arbitration header
  *  b0
  *       0: message without defining byte
  *       1: message with defining byte (LL_I3C_DEFINE_BYTE)
  *
  *  other bits (not used).
    */
typedef enum
{
  HAL_I3C_PRIVATE_WITH_ARB_RESTART = (LL_I3C_GENERATE_STOP), /*!<  Restart between each I3C private message then Stop
  request for last message. */

  HAL_I3C_PRIVATE_WITH_ARB_STOP = (LL_I3C_GENERATE_STOP | LL_I3C_CONTROLLER_MTYPE_PRIVATE), /*!<  Stop between each I3C
  private message. Each message start with an arbitration header after start bit condition. */

