MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.h
  HAL_I3C_PRIVATE_WITHOUT_ARB_RESTART = (LL_I3C_CONTROLLER_MTYPE_PRIVATE | I3C_CFGR_NOARBH), /*!<  Restart between each
  I3C message then stop request for last message. Each message start with target address after start bit condition. */

  HAL_I3C_PRIVATE_WITHOUT_ARB_STOP = (LL_I3C_GENERATE_STOP | LL_I3C_CONTROLLER_MTYPE_PRIVATE | I3C_CFGR_NOARBH), /*!<
  Stop between each I3C private message. Each message start with target address after start bit condition. */

  HAL_I2C_PRIVATE_WITH_ARB_RESTART = (LL_I3C_CONTROLLER_MTYPE_LEGACY_I2C), /*!<  Restart between each I2C private
  message then stop request for last message. Each message start with an arbitration header after start bit condition.*/

  HAL_I2C_PRIVATE_WITH_ARB_STOP = (LL_I3C_GENERATE_STOP | LL_I3C_CONTROLLER_MTYPE_LEGACY_I2C), /*!<  Stop between each
  I2C private message. Each message start with an arbitration header after start bit condition. */

  HAL_I2C_PRIVATE_WITHOUT_ARB_RESTART = (LL_I3C_CONTROLLER_MTYPE_LEGACY_I2C | I3C_CFGR_NOARBH), /*!<  Restart between
  each I2C message then stop request for last message. Each message start with target address after start bit condition.
  */

  HAL_I2C_PRIVATE_WITHOUT_ARB_STOP = (LL_I3C_GENERATE_STOP | LL_I3C_CONTROLLER_MTYPE_LEGACY_I2C | I3C_CFGR_NOARBH), /*!<
  Stop between each I2C private message. Each message start with target address after start bit condition. */

  HAL_I3C_CCC_DIRECT_WITH_DEFBYTE_RESTART = (LL_I3C_CONTROLLER_MTYPE_DIRECT | LL_I3C_DEFINE_BYTE), /*!< Restart
  between each direct command then stop request for last command. Each command has an associated defining byte */

  HAL_I3C_CCC_DIRECT_WITH_DEFBYTE_STOP = (LL_I3C_GENERATE_STOP | LL_I3C_CONTROLLER_MTYPE_DIRECT  | LL_I3C_DEFINE_BYTE),
  /*!< Stop between each direct command.  Each command has an associated defining byte. */

  HAL_I3C_CCC_DIRECT_WITHOUT_DEFBYTE_RESTART = (LL_I3C_CONTROLLER_MTYPE_DIRECT), /*!< Restart between each direct
  command then stop request for last command. Each command does not have an associated defining byte. */

  HAL_I3C_CCC_DIRECT_WITHOUT_DEFBYTE_STOP = (LL_I3C_GENERATE_STOP | LL_I3C_CONTROLLER_MTYPE_DIRECT), /*!< Stop
  between each direct command. Each command does not have an associated defining byte. */

  HAL_I3C_CCC_BROADCAST_WITH_DEFBYTE_RESTART = (LL_I3C_CONTROLLER_MTYPE_CCC | LL_I3C_DEFINE_BYTE), /*!< Restart between
  each broadcast command then stop request for last command. Each command has an associated defining byte. */

  HAL_I3C_CCC_BROADCAST_WITH_DEFBYTE_STOP = (LL_I3C_GENERATE_STOP | LL_I3C_CONTROLLER_MTYPE_CCC | LL_I3C_DEFINE_BYTE),
  /*!< Stop between each broadcast command. Each command has an associated defining byte. */

  HAL_I3C_CCC_BROADCAST_WITHOUT_DEFBYTE_RESTART = (LL_I3C_CONTROLLER_MTYPE_CCC), /*!< Restart between each broadcast
  command then stop request for last command. Each command does not have an associated defining byte. */

  HAL_I3C_CCC_BROADCAST_WITHOUT_DEFBYTE_STOP = (LL_I3C_GENERATE_STOP | LL_I3C_CONTROLLER_MTYPE_CCC) /*!< Stop between
  each broadcast command. Each command does not have an associated defining byte. */
} hal_i3c_transfer_mode_t;

/**
  * @brief    Strategy used by Controller to (re)enumerate dynamic addresses.
  * @details  Selects how the controller manages dynamic address distribution:
  *           - RSTDAA+ENTDAA: full reset of any previously assigned dynamic addresses followed by a fresh
  *             enumeration (use after topology changes or suspected collisions).
  *           - ENTDAA only: perform enumeration assuming no stale dynamic addresses are present (faster
  *             startup on a clean bus or after global reset).
  */
typedef enum
{
  HAL_I3C_DYN_ADDR_RSTDAA_THEN_ENTDAA = 0U, /*!< Full re-enumeration: issue RSTDAA to clear all dynamic addresses
                                                 then run ENTDAA to assign new ones. Ensures a clean address map. */
  HAL_I3C_DYN_ADDR_ONLY_ENTDAA        = 1U  /*!< Quick enumeration: run ENTDAA directly. Use when bus is known to be
                                                 in pristine state (e.g. initial power-up) to save time. */
} hal_i3c_dyn_addr_opt_t;

/**
  * @brief    Special bus patterns (reset, HDR exit) emitted by controller.
  * @details  Patterns are special electrical/sequence encodings placed on the bus outside normal frame transfers.
  *           They are used to signal global state changes:
  *           - Target Reset: issues a bus-level reset indication recognized by compliant targets.
  *           - HDR Exit: transitions all devices from High Data Rate mode back to Standard Data Rate (SDR).
  */
typedef enum
{
  HAL_I3C_PATTERN_TGT_RESET = 0U, /*!< Inject reset pattern to request targets reinitialize transient state. */
  HAL_I3C_PATTERN_HDR_EXIT  = 1U  /*!< Inject exit pattern to terminate HDR mode and restore SDR signaling. */
} hal_i3c_pattern_opt_t;

/**
  * @brief    Data phase direction (controller write or read).
  */
typedef enum
{
  HAL_I3C_DIRECTION_WRITE = LL_I3C_DIRECTION_WRITE, /*!< Controller sends data bytes to the addressed target */
  HAL_I3C_DIRECTION_READ  = LL_I3C_DIRECTION_READ,  /*!< Controller receives data bytes from the addressed target */
} hal_i3c_direction_t;

/**
  * @brief    Rx FIFO service granularity (byte vs word trigger level).
  * @details  The Rx FIFO size is 8 bytes (2 words) and an interrupt is generated while it is not empty.
  *           The selected threshold guides whether Software/DMA reads the FIFO one byte at a time or one word
  *           at a time. Advantages:
  *             - 1/8 (1 bytes threshold / 8 bytes FIFO): minimal read latency; finer flow control;
  *               better for short or sporadic transfers; simpler handling when parsing variable-length headers.
  *             - 1/2 (1 word threshold / 2 words FIFO): fewer service events (lower CPU/IRQ/DMA overhead);
  *               higher effective throughput on long bursts; improved bus efficiency when payload size is large.
  *           Choose based on latency sensitivity versus servicing overhead.
  */
typedef enum
{
  HAL_I3C_RX_FIFO_THRESHOLD_1_8 = LL_I3C_RXFIFO_THRESHOLD_1_8, /*!< 1 byte threshold / 8 bytes FIFO.
                                                                    Software/DMA reads byte while Rx FIFO is not
                                                                    empty. */

  HAL_I3C_RX_FIFO_THRESHOLD_1_2 = LL_I3C_RXFIFO_THRESHOLD_1_2, /*!< 1 word threshold / 2 words FIFO.
                                                                    Software/DMA reads word while Rx FIFO is not
                                                                    empty. */
} hal_i3c_rx_fifo_threshold_t;

/**
  * @brief    Tx FIFO service granularity (byte vs word trigger level).
  * @details  The Tx FIFO size is 8 bytes (2 words) and an interrupt is generated while the Tx FIFO is not full.
  *           The selected threshold guides whether Software/DMA writes the FIFO one byte at a time or one word
  *           at a time. Advantages:
  *             - 1/8 (1 bytes threshold / 8 bytes FIFO): minimal read latency; finer flow control;
  *               better for short or sporadic transfers; simpler handling when parsing variable-length headers.
  *             - 1/2 (1 word threshold / 2 words FIFO): fewer service events (lower CPU/IRQ/DMA overhead);
  *               higher effective throughput on long bursts; improved bus efficiency when payload size is large.
  *           Choose based on latency sensitivity versus servicing overhead.
  */
typedef enum
{
  HAL_I3C_TX_FIFO_THRESHOLD_1_8 = LL_I3C_TXFIFO_THRESHOLD_1_8, /*!< 1 byte threshold / 8 bytes FIFO.
                                                                    Software/DMA writes byte while Tx FIFO is not
                                                                    full. */

  HAL_I3C_TX_FIFO_THRESHOLD_1_2 = LL_I3C_TXFIFO_THRESHOLD_1_2, /*!< 1 word threshold / 2 words FIFO.
                                                                    Software/DMA writes word while Tx FIFO is not
                                                                    full. */
} hal_i3c_tx_fifo_threshold_t;

/**
  * @brief    Selection of Transmit Control (TC) and Receive Status (RS) FIFOs activation.
  */
typedef enum
{
  HAL_I3C_CTRL_FIFO_NONE         = LL_I3C_CTRL_FIFO_NONE,         /*!< Transmit Control (TC) and Receive Status (RS)
                                                                       FIFOs are disabled */

  HAL_I3C_CTRL_FIFO_CONTROL_ONLY = LL_I3C_CTRL_FIFO_CONTROL_ONLY, /*!< Enable Transmit Control (TC) to queue control
                                                                       words to be transmitted */

  HAL_I3C_CTRL_FIFO_STATUS_ONLY  = LL_I3C_CTRL_FIFO_STATUS_ONLY,  /*!< Enable Receive Status (RS) FIFO to capture
                                                                       status words received */

