MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.h
  HAL_I3C_CTRL_FIFO_ALL          = LL_I3C_CTRL_FIFO_ALL           /*!< Both TC and RS FIFOs are enabled */
} hal_i3c_ctrl_fifo_t;

/**
  * @brief     Control FIFO (C-FIFO) Status.
  */
typedef enum
{
  HAL_I3C_CONTROL_FIFO_DISABLED = 0U, /*!< Control FIFO is disabled */
  HAL_I3C_CONTROL_FIFO_ENABLED  = 1U  /*!< Control FIFO is enabled */
} hal_i3c_control_fifo_status_t;

/**
  * @brief     Status FIFO (S-FIFO) Status.
  */
typedef enum
{
  HAL_I3C_STATUS_FIFO_DISABLED = 0U, /*!< Status FIFO is disabled */
  HAL_I3C_STATUS_FIFO_ENABLED  = 1U  /*!< Status FIFO is enabled */
} hal_i3c_status_fifo_status_t;

/**
  * @brief    Number of data bytes appended after IBI acknowledge.
  * @details  Specifies how many data bytes follow the IBI acknowledge phase when a target asserts
  *           an In-Band Interrupt. These bytes typically convey a cause code, sensor snapshot or
  *           status flags allowing the initiator to react without issuing a separate read.
  *           Selecting the minimal size reduces bus occupancy; larger payloads allow richer
  *           contextual information at the cost of a few extra cycles.
  */
typedef enum
{
  HAL_I3C_TGT_PAYLOAD_EMPTY  = LL_I3C_PAYLOAD_EMPTY,   /*!< Empty payload, no additional data after IBI acknowledge */
  HAL_I3C_TGT_PAYLOAD_1_BYTE = LL_I3C_PAYLOAD_1_BYTE,  /*!< 1 additional data byte after IBI acknowledge */
  HAL_I3C_TGT_PAYLOAD_2_BYTE = LL_I3C_PAYLOAD_2_BYTE,  /*!< 2 additional data bytes after IBI acknowledge */
  HAL_I3C_TGT_PAYLOAD_3_BYTE = LL_I3C_PAYLOAD_3_BYTE,  /*!< 3 additional data bytes after IBI acknowledge */
  HAL_I3C_TGT_PAYLOAD_4_BYTE = LL_I3C_PAYLOAD_4_BYTE   /*!< 4 additional data bytes after IBI acknowledge */
} hal_i3c_tgt_payload_size_t;

/**
  * @brief    Advertised recent bus activity level (power/perf hint).
  * @details  Encodes recent bus traffic level for power/performance heuristics. Targets can adjust
  *           internal low-power policies or clocking based on the advertised activity state. Higher
  *           numbers generally indicate more frequent transfers or reduced idle periods.
  */
typedef enum
{
  HAL_I3C_ACTIVITY_STATE_0 = LL_I3C_BUS_ACTIVITY_STATE_0, /*!< Activity state 0 */
  HAL_I3C_ACTIVITY_STATE_1 = LL_I3C_BUS_ACTIVITY_STATE_1, /*!< Activity state 1 */
  HAL_I3C_ACTIVITY_STATE_2 = LL_I3C_BUS_ACTIVITY_STATE_2, /*!< Activity state 2 */
  HAL_I3C_ACTIVITY_STATE_3 = LL_I3C_BUS_ACTIVITY_STATE_3  /*!< Activity state 3 */
} hal_i3c_activity_state_t;

/**
  * @brief    Scope of peripheral reset to apply.
  */
typedef enum
{
  HAL_I3C_RESET_ACTION_NONE    = LL_I3C_RESET_ACTION_NONE,    /*!< No reset action required */
  HAL_I3C_RESET_ACTION_PARTIAL = LL_I3C_RESET_ACTION_PARTIAL, /*!< Reset some internal registers of the peripheral */
  HAL_I3C_RESET_ACTION_FULL    = LL_I3C_RESET_ACTION_FULL     /*!< Reset all internal registers of the peripheral */
} hal_i3c_reset_action_t;

/**
  * @brief    Intended bus activity level immediately after controller handoff.
  * @details  Advertised bus activity level the device intends to maintain immediately after it
  *           assumes Controller-Role (post handoff). Guides peers power management expectations.
  *           Higher states imply shorter idle windows and potentially higher average power draw.
  */
typedef enum
{
  HAL_I3C_HANDOFF_ACTIVITY_STATE_0 = LL_I3C_HANDOFF_ACTIVITY_STATE_0,  /*!< Activity state 0 after handoff */
  HAL_I3C_HANDOFF_ACTIVITY_STATE_1 = LL_I3C_HANDOFF_ACTIVITY_STATE_1,  /*!< Activity state 1 after handoff */
  HAL_I3C_HANDOFF_ACTIVITY_STATE_2 = LL_I3C_HANDOFF_ACTIVITY_STATE_2,  /*!< Activity state 2 after handoff */
  HAL_I3C_HANDOFF_ACTIVITY_STATE_3 = LL_I3C_HANDOFF_ACTIVITY_STATE_3   /*!< Activity state 3 after handoff */
} hal_i3c_handoff_activity_state_t;

/**
  * @brief    Target device clock-to-valid-data timing class (tSCO capability).
  * @details  Declares the device's timing capability from the rising edge of SCL to valid data on SDA.
  *           Used during timing negotiation so the controller can honour the slowest participant.
  *           LESS_12NS indicates a faster device (tSCO <= 12 ns); GREATER_12NS requires relaxed sampling.
  */
typedef enum
{
  HAL_I3C_TURNAROUND_TIME_TSCO_LESS_12NS    = LL_I3C_TURNAROUND_TIME_TSCO_LESS_12NS,   /*!< clock-to-data turnaround
                                                                                            time tSCO <= 12ns */
  HAL_I3C_TURNAROUND_TIME_TSCO_GREATER_12NS = LL_I3C_TURNAROUND_TIME_TSCO_GREATER_12NS /*!< clock-to-data turnaround
                                                                                            time tSCO > 12ns  */
} hal_i3c_turnaround_time_tsco_t;


/**
  * @brief    Max data speed limitation status (BCR bit 0).
  */
typedef enum
{
  HAL_I3C_MAX_SPEED_LIMITATION_DISABLED = LL_I3C_NO_DATA_SPEED_LIMITATION, /*!< BCR[0]=0: max speed limitation disabled */
  HAL_I3C_MAX_SPEED_LIMITATION_ENABLED  = LL_I3C_MAX_DATA_SPEED_LIMITATION /*!< BCR[0]=1: max speed limitation enabled */
} hal_i3c_max_speed_limitation_status_t;

/**
  * @brief    IBI request status (BCR bit 1).
  */
typedef enum
{
  HAL_I3C_IBI_REQ_DISABLED = LL_I3C_IBI_REQUEST_NOT_SUPPORTED, /*!< BCR[1]=0: IBI request disabled */
  HAL_I3C_IBI_REQ_ENABLED  = LL_I3C_IBI_REQUEST_SUPPORTED      /*!< BCR[1]=1: IBI request enabled */
} hal_i3c_ibi_req_status_t;

/**
  * @brief    Ability to send data byte(s) with an IBI (BCR bit 2).
  */
typedef enum
{
  HAL_I3C_IBI_PAYLOAD_DISABLED = LL_I3C_IBI_NO_ADDITIONAL_DATA, /*!< BCR[2]=0: IBI payload disabled */
  HAL_I3C_IBI_PAYLOAD_ENABLED  = LL_I3C_IBI_ADDITIONAL_DATA     /*!< BCR[2]=1: IBI payload enabled */
} hal_i3c_ibi_payload_status_t;

/**
  * @brief    Offline capable status (BCR bit 3).
  */
typedef enum
{
  HAL_I3C_OFFLINE_CAPABLE_DISABLED = LL_I3C_NO_OFFLINE_CAPABLE, /*!< BCR[3]=0: offline not supported */
  HAL_I3C_OFFLINE_CAPABLE_ENABLED  = LL_I3C_OFFLINE_CAPABLE     /*!< BCR[3]=1: offline supported */
} hal_i3c_offline_capable_status_t;

/**
  * @brief    Virtual target support status (BCR bit 4).
  */
typedef enum
{
  HAL_I3C_VIRTUAL_TGT_DISABLED = LL_I3C_VIRTUAL_TARGET_NOT_SUPPORTED, /*!< BCR[4]=0: virtual target not supported */
  HAL_I3C_VIRTUAL_TGT_ENABLED  = LL_I3C_VIRTUAL_TARGET_SUPPORTED      /*!< BCR[4]=1: virtual target supported */
} hal_i3c_virtual_tgt_status_t;

/**
  * @brief    Advanced capabilities status (BCR bit 5).
  */
typedef enum
{
  HAL_I3C_ADV_CAPABILITIES_DISABLED = LL_I3C_ADV_CAP_NOT_SUPPORTED, /*!< BCR[5]=0: advanced capabilities disabled */
  HAL_I3C_ADV_CAPABILITIES_ENABLED  = LL_I3C_ADV_CAP_SUPPORTED      /*!< BCR[5]=1: advanced capabilities enabled */
} hal_i3c_adv_capabilities_status_t;

/**
  * @brief    Target device Controller-Role status  (BCR bit 5).
  */
typedef enum
{
  HAL_I3C_CTRL_ROLE_DISABLED = LL_I3C_DEVICE_ROLE_AS_TARGET,    /*!< BCR[6]=0: Target device must not request
                                                                     Controller-Role handoff */
  HAL_I3C_CTRL_ROLE_ENABLED  = LL_I3C_DEVICE_ROLE_AS_CONTROLLER /*!< BCR[6]=1:Target device can request
                                                                     Controller-Role handoff */
} hal_i3c_ctrl_role_status_t;


/**
  * @brief    Controller acknowledge policy for target IBI requests.
  */
typedef enum
{
  HAL_I3C_CTRL_IBI_ACK_DISABLED = LL_I3C_IBI_NO_CAPABILITY, /*!< Controller NACKs the IBI requests from the target */
  HAL_I3C_CTRL_IBI_ACK_ENABLED  = LL_I3C_IBI_CAPABILITY     /*!< Controller ACKs the IBI requests from the target */
} hal_i3c_ctrl_ibi_ack_status_t;

/**
  * @brief    Controller response status to a Controller-Role request from target device.
  */
typedef enum
{
  HAL_I3C_CTRL_ROLE_ACK_DISABLED = LL_I3C_CR_NO_CAPABILITY, /*!< Controller NACK when receiving a Controller-Role
                                                                 request from the target device */
  HAL_I3C_CTRL_ROLE_ACK_ENABLED  = LL_I3C_CR_CAPABILITY     /*!< Controller ACK when receiving a Controller-Role
                                                                 request from the target device */
} hal_i3c_ctrl_role_ack_status_t;


/**
  * @brief     Controller suspend/stop policy on IBI reception (SUSP bit).
  */
typedef enum
{
  HAL_I3C_CTRL_STOP_TRANSFER_DISABLED = LL_I3C_SUSP_DISABLE, /*!< Do not auto STOP/flush on IBI completion */
  HAL_I3C_CTRL_STOP_TRANSFER_ENABLED  = LL_I3C_SUSP_ENABLE   /*!< Auto STOP + flush C-FIFO/TX-FIFO on IBI completion */
} hal_i3c_ctrl_stop_transfer_status_t;

/**
  * @brief    Controller IBI payload policy.
  */
typedef enum
{
  HAL_I3C_CTRL_IBI_PAYLOAD_DISABLED = LL_I3C_IBI_DATA_DISABLE, /*!< Data follows the IBI ACK */
  HAL_I3C_CTRL_IBI_PAYLOAD_ENABLED  = LL_I3C_IBI_DATA_ENABLE   /*!< No data follows the IBI ACK */
} hal_i3c_ctrl_ibi_payload_status_t;

/**
  * @brief    IBI capability from target point of view.
  */
typedef enum
{
  HAL_I3C_TGT_IBI_DISABLED = 0U, /*!< IBI is not supported by target device */
  HAL_I3C_TGT_IBI_ENABLED  = 1U  /*!< IBI supported by target device */
} hal_i3c_tgt_ibi_status_t;

/**
  * @brief    Controller-Role capability from target point of view.
  */
typedef enum
{
  HAL_I3C_TGT_CTRL_ROLE_DISABLED = 0U, /*!< Controller-Role is not supported by target device */
  HAL_I3C_TGT_CTRL_ROLE_ENABLED  = 1U  /*!< Controller-Role is supported by target device */
} hal_i3c_tgt_ctrl_role_status_t;

/**
  * @brief    Target detection status during DAA procedure.
  */
typedef enum
{
  HAL_I3C_TGT_NOT_DETECTED = 0U, /*!< No target has been detected */
  HAL_I3C_TGT_DETECTED     = 1U  /*!< A target has been detected  */
} hal_i3c_target_detection_status_t;
/**
  * @brief    Handoff delay status.
  */
typedef enum
{
  HAL_I3C_HANDOFF_DELAY_DISABLED = 0U, /*!< Handoff delay is disabled */
  HAL_I3C_HANDOFF_DELAY_ENABLED  = 1U  /*!< Handoff delay is enabled */
} hal_i3c_handoff_delay_status_t;

/**
  * @brief    Group address capability status.
  */
typedef enum
{
  HAL_I3C_GRP_ADDR_CAPABILITY_DISABLED = 0U, /*!< Group address capability is disabled */
  HAL_I3C_GRP_ADDR_CAPABILITY_ENABLED  = 1U  /*!< Group address capability is enabled */
} hal_i3c_grp_addr_capability_status_t;

/**
  * @brief GETMXDS CCC format and maximum read turnaround byte latency.
  * Format 1 : No 3-byte MaxRdTurn (maximum read turnaround byte) is returned.
  * Format 2 : 3-byte MaxRdTurn (maximum read turnaround byte) is returned.
  */
typedef enum
{
  HAL_I3C_GETMXDS_FORMAT_1     = LL_I3C_GETMXDS_FORMAT_1, /*!< No 3-byte MaxRdTurn (maximum read turnaround byte). */

  HAL_I3C_GETMXDS_FORMAT_2_LSB = LL_I3C_GETMXDS_FORMAT_2_LSB, /*!< (<256 us) Target maximum read turnaround byte
                                                  (RDTURN[7:0]) placed in the least-significant byte of the 3-byte
                                                  MaxRdTurn (middle & MSB = 0)  */

  HAL_I3C_GETMXDS_FORMAT_2_MID = LL_I3C_GETMXDS_FORMAT_2_MID, /*!< (256 us to 65 ms) Target maximum read turnaround byte
                                                  (RDTURN[7:0]) placed in the middle byte of the 3-byte
                                                  MaxRdTurn  (LSB & MSB = 0) */

  HAL_I3C_GETMXDS_FORMAT_2_MSB = LL_I3C_GETMXDS_FORMAT_2_MSB /*!< (65 ms to 16 s) Target maximum read turnaround byte
                                                  (RDTURN[7:0]) placed in the most-significant byte of the 3-byte
                                                  MaxRdTurn (LSB & MID = 0)   */
} hal_i3c_getmxds_format_t;

/**
  * @brief    Hot-Join status.
  */
typedef enum
{
  HAL_I3C_HOT_JOIN_DISABLED = 0U, /*!< Hot-Join is disabled */
  HAL_I3C_HOT_JOIN_ENABLED  = 1U  /*!< Hot-Join is enabled */
} hal_i3c_hot_join_status_t;

/**
  * @brief    SDA high keeper enable state.
  */
typedef enum
{
  HAL_I3C_HIGH_KEEPER_SDA_DISABLED = 0U, /*!< The controller SDA high keeper is disabled */
  HAL_I3C_HIGH_KEEPER_SDA_ENABLED  = 1U  /*!< The controller SDA high keeper is enabled */
} hal_i3c_high_keeper_sda_status_t;

/**
  * @brief    Reset Pattern status.
  */
typedef enum
{
  HAL_I3C_RESET_PATTERN_DISABLED = 0U, /*!< Standard STOP condition emitted at the end of a frame */
  HAL_I3C_RESET_PATTERN_ENABLED  = 1U  /*!< Reset pattern is inserted before the STOP condition of any emitted frame */
} hal_i3c_reset_pattern_status_t;

/**
  * @brief    Pending mandatory data bytes notification with GETCAPR.
  */
typedef enum
{
  HAL_I3C_PENDING_READ_MDB_DISABLED = LL_I3C_MDB_NO_PENDING_READ_NOTIFICATION, /*!< Pending read mandatory data bytes
                                                                                    is disabled */
  HAL_I3C_PENDING_READ_MDB_ENABLED  = LL_I3C_MDB_PENDING_READ_NOTIFICATION     /*!< Pending read mandatory data bytes
                                                                                    is enabled */
} hal_i3c_tgt_read_mdb_status_t;

/**
  * @brief    Software descriptor for direct or broadcast CCC frame.
  */
typedef struct
{
  uint8_t  tgt_addr;               /*!< 7-bit dynamic or static target address placed on the bus.
                                        For broadcast CCC the broadcast address (7'h7E) is used. */

  uint8_t  ccc;                    /*!< 7-bit CCC opcode (direct or broadcast) per I3C specification section CCC.
                                        Distinguishes the command semantic. */

  uint32_t data_size_byte;         /*!< Number of data bytes associated with the CCC (including defining byte when present).
                                        Set to 0 if no data phase is required. */

  hal_i3c_direction_t direction;   /*!< Data phase direction: READ or WRITE. Must be WRITE for broadcast CCC.
                                        Direct CCC can be READ or WRITE depending on opcode definition. */
} hal_i3c_ccc_desc_t;

/**
  * @brief    Decoded BCR capability/status bits for a target.
  * @details  Populated from ENTDAA payload; each field mirrors one BCR capability bit or status for later use in
  *           controller configuration and application policy.
  */
typedef struct
{
  hal_i3c_max_speed_limitation_status_t max_data_speed_limitation;  /*!<
                                        HAL_I3C_MAX_SPEED_LIMITATION_ENABLED => target cannot operate at highest
                                        bus speed.
                                        HAL_I3C_MAX_SPEED_LIMITATION_DISABLED => no speed limitation declared. */

  hal_i3c_ibi_req_status_t              ibi_request_capable; /*!<
                                        HAL_I3C_IBI_REQ_ENABLED => target can initiate an In-Band Interrupt (IBI)
                                        to request service.
                                        HAL_I3C_IBI_REQ_DISABLED => target never issues IBI requests. */

