MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.h
  hal_i3c_ibi_payload_status_t          ibi_payload; /*!<
                                        Capability to append one data byte (or more depending on config)
                                        after IBI acceptance to qualify the interrupt source. */

  hal_i3c_offline_capable_status_t      offline_capable;  /*!< Target can temporarily not respond to bus commands.
                                        HAL_I3C_OFFLINE_CAPABLE_ENABLED => controller must tolerate silent periods.
                                        HAL_I3C_OFFLINE_CAPABLE_DISABLED => target expected to respond consistently. */

  hal_i3c_virtual_tgt_status_t          virtual_target_support;
  /*!< Identifies a virtual (composite / logical) target rather than a
  discrete physical device. */

  hal_i3c_adv_capabilities_status_t     advanced_capabilities; /*!< Target implements optional advanced I3C
                                        capabilities beyond the baseline feature set (e.g. controller role
                                        hand-off readiness). */

  hal_i3c_ctrl_role_status_t            ctrl_role; /*!< Target Controller-Role.
                                        HAL_I3C_CTRL_ROLE_ENABLED => target can request a Controller-Role
                                        handoff during Dynamic Address Assignment (DAA) or via a Controller-Role (CR)
                                        request sequence.
                                        HAL_I3C_CTRL_ROLE_DISABLED => target cannot request a Controller-Role
                                        handoff and any such attempt is ignored by higher-level policy. */
} hal_i3c_bcr_t;

/**
  * @brief    Decoded Provisioned ID (PID) fields.
  */
typedef struct
{
  uint16_t  mipi_manuf_id; /*!< MIPI-assigned manufacturer ID (PID bits [47:33]). */
  uint8_t   id_type_sel;   /*!< PID type selector / IDTSEL (format discriminator, PID bit [32]). */
  uint16_t  part_id;       /*!< Vendor part identifier (PID bits [31:21]) distinguishing device model/revision. */
  uint8_t   mipi_id;       /*!< Instance ID within the part family (PID bits [20:17]) for multiple identical
                                targets. */
} hal_i3c_pid_t;

/**
  * @brief    Software descriptor for a private frame (I3C or legacy I2C).
  */
typedef struct
{
  uint8_t              tgt_addr;        /*!< 7-bit dynamic or static target address placed on the bus */
  uint32_t             data_size_byte;  /*!< Number of data bytes to transmit or receive in the data phase.
                                             Set to 0 for pure header-only operations (rare). */
  hal_i3c_direction_t  direction;       /*!< Data direction for the frame: WRITE sends bytes from controller to target,
                                             READ requests bytes from target. */
} hal_i3c_private_desc_t;

/**
  * @brief    Aggregated multi-frame transfer context (descriptors + buffers).
  * @note     All frames aggregated in a transfer context must share the same high-level transfer mode
  *           @ref hal_i3c_transfer_mode_t
  */
typedef struct
{
  uint32_t *p_tc_data;      /*!< Pointer to transmit control descriptor words populated by
                                 @ref HAL_I3C_CTRL_BuildTransferCtxPrivate or
                                 @ref HAL_I3C_CTRL_BuildTransferCtxCCC */

  uint32_t tc_size_word;    /*!< Control buffer size depends on the transfer mode and the number of aggregated frames.
                                 The helper @ref HAL_I3C_GET_CTRL_BUFFER_SIZE_WORD can be used to get it. */

  const uint8_t *p_tx_data; /*!< Pointer to concatenated transmit payload(s) for all frames needing TX phase.
                                 Frames reference offsets implicitly in the order they are executed. */

  uint32_t tx_size_byte;    /*!< Total number of transmit bytes across all frames. Set to 0 if no TX phase. */

  uint8_t *p_rx_data;       /*!< Pointer to receive buffer storing concatenated RX data of frames with read phase. */

  uint32_t rx_size_byte;    /*!< Total expected receive bytes across all frames. Set to 0 if no RX phase. */

  hal_i3c_transfer_mode_t transfer_mode; /*!< Transfer mode bitfield (HAL_I3C_PRIVATE_xxx or HAL_I3C_CCC_xxx) governing
                                              arbitration, stop/restart behavior, and message type. */

  uint32_t nb_tx_frame;     /*!< Number of frames that have a transmit portion (debug / parameter checking aid). */
} hal_i3c_transfer_ctx_t;

/**
  * @brief    Controller timing configuration.
  * @details  Pre-computed I3C_TIMINGR0 / I3C_TIMINGR1 register values (prescalers + timing segments) generated by
  *           tooling (CubeMX2 / helpers). Used verbatim by HAL_I3C_CTRL_SetConfig(). Keep the pair consistent.
  */
typedef struct
{
  uint32_t  timing_reg0;  /*!< Encoded I3C_TIMINGR0 register value (prescalers + low/high periods for SDR/legacy).
                               Must be generated to satisfy bus frequency constraints of all attached targets. */

  uint32_t  timing_reg1;  /*!< Encoded I3C_TIMINGR1 register value (additional setup/hold segments and filter tuning).
                               Derived together with timing_reg0; keep the pair consistent. */
} hal_i3c_ctrl_config_t;

/**
  * @brief    Target timing configuration.
  * @details  Pre-computed I3C_TIMINGR1 register values (target turnaround / filtering) generated by
  *           tooling (CubeMX2 / helpers). Used verbatim by HAL_I3C_TGT_SetConfig().
  */
typedef struct
{
  uint32_t timing_reg1;   /*!< Encoded I3C_TIMINGR1 register value used when peripheral operates as target
                               to meet bus timing constraints. */
} hal_i3c_tgt_config_t;

/**
  * @brief    ENTDAA advertised capability payload (target identity fields for BCR/DCR/PID synthesis).
  */
typedef struct
{
  uint8_t identifier;      /*!< Target characteristic ID (MIPI named reference DCR). This parameter must be a number
                                between Min_Data=0x00 and Max_Data=0xFF. */

  uint8_t mipi_identifier; /*!< Bits [12-15] of the 48 bit provisioned ID (MIPI named reference PID).
                                This parameter must be a number between Min_Data=0x0 and Max_Data=0xF. */

  hal_i3c_ctrl_role_status_t            ctrl_role; /*!< Target can request Controller-Role handoff (BCR bit) */
  hal_i3c_ibi_payload_status_t          ibi_payload; /*!< Target can send data after an acknowledged IBI (BCR bit) */
  hal_i3c_max_speed_limitation_status_t max_data_speed_limitation; /*!< Target max data speed limitation (BCR bit) */
} hal_i3c_tgt_config_payload_entdaa_t;

/**
  * @brief    Controller FIFOs thresholds and enable selection.
  */
typedef struct
{
  hal_i3c_rx_fifo_threshold_t  rx_fifo_threshold; /*!< I3C Rx FIFO threshold level */
  hal_i3c_tx_fifo_threshold_t  tx_fifo_threshold; /*!< I3C Tx FIFO threshold level */
  hal_i3c_ctrl_fifo_t          ctrl_fifo;         /*!< I3C control and status activation */
} hal_i3c_ctrl_fifo_config_t;

/**
  * @brief    Target FIFOs thresholds configuration.
  */
typedef struct
{
  hal_i3c_rx_fifo_threshold_t  rx_fifo_threshold; /*!< I3C Rx FIFO threshold level */
  hal_i3c_tx_fifo_threshold_t  tx_fifo_threshold; /*!< I3C Tx FIFO threshold level */
} hal_i3c_tgt_fifo_config_t;

/**
  * @brief    Target IBI payload size & pending-read notification configuration.
  */
typedef struct
{
  hal_i3c_tgt_payload_size_t     ibi_payload_size_byte; /*!< I3C target payload data size */
  hal_i3c_tgt_read_mdb_status_t  pending_read_mdb;      /*!< Transmission of a mandatory data bytes indicating a pending
                                                             read notification for GETCAPR CCC command */
} hal_i3c_tgt_ibi_config_t;

/**
  * @brief    Target GETMXDS response parameters (format, activity, timing).
  */
typedef struct
{
  hal_i3c_getmxds_format_t          getmxds_format;           /*!< GETMXDS CCC Format */
  hal_i3c_handoff_activity_state_t  ctrl_handoff_activity;    /*!< I3C Target activity when becoming controller */
  hal_i3c_turnaround_time_tsco_t    data_turnaround_duration; /*!< I3C target clock-to-data turnaround time */
  uint8_t max_read_turnaround;  /*!< Target maximum read turnaround byte (RDTURN[7:0]). This parameter must be a number
                                     between Min_Data=0x00 and Max_Data=0xFF*/
} hal_i3c_tgt_getmxds_config_t;

/**
  * @brief    Target device configuration from controller point of view. Store in DEVRx registers.
  */
typedef struct
{
  uint8_t device_index;     /*!< Index value of the target device in the DEVRx register.
                                 This parameter must be a number between Min_Data=0 and Max_Data=3 */

  uint8_t tgt_dynamic_addr; /*!< Dynamic address of the target device.
                                 This parameter must be a number between Min_Data=0x00 and Max_Data=0x7F */

  hal_i3c_ctrl_ibi_ack_status_t        ibi_ack;            /*!< Controller ack when receiving an IBI from the target
                                                                device */

  hal_i3c_ctrl_ibi_payload_status_t    ibi_payload;        /*!< Target IBI payload after an IBI. Information retrieved
                                                                from the target device during broadcast ENTDAA or
                                                                direct GETBCR CCC */

