MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.h
  hal_i3c_ctrl_role_ack_status_t       ctrl_role_req_ack;  /*!< Controller ack when receiving a Controller-Role request
                                                                from the target device */

  hal_i3c_ctrl_stop_transfer_status_t  ctrl_stop_transfer; /*!< Controller stops transfer after receiving an IBI
                                                                from the target device */
} hal_i3c_ctrl_device_config_t;

/**
  * @brief    ENTDAA combined BCR/DCR/PID payload fields.
  */
typedef struct
{
  hal_i3c_bcr_t  bcr; /*!< Bus characteristics register */
  uint32_t       dcr; /*!< Device characteristics register */
  hal_i3c_pid_t  pid; /*!< Provisioned ID */
} hal_i3c_entdaa_payload_t;

/**
  * @brief  Target/Controller gets the Common Command Code (CCC) information updated after notifications.
  *   CCC Notification                    | Updated fields in p_ccc_info
  *  -------------------------------------|-----------------------------------------------------
  *   HAL_I3C_TGT_NOTIFICATION_DAU        | dynamic_addr, dynamic_addr_valid
  *   HAL_I3C_TGT_NOTIFICATION_SETMWL     | max_write_data_size_byte
  *   HAL_I3C_TGT_NOTIFICATION_SETMRL     | max_read_data_size_byte
  *   HAL_I3C_TGT_NOTIFICATION_RSTACT     | reset_action
  *   HAL_I3C_TGT_NOTIFICATION_ENTAS_X    | activity_state
  *   HAL_I3C_TGT_NOTIFICATION_ENEC_DISEC | hot_join_allowed, in_band_allowed, ctrl_role_allowed
  *   HAL_I3C_CTRL_NOTIFICATION_IBI       | ibi_cr_tgt_addr, ibi_tgt_nb_payload, ibi_tgt_payload
  *   HAL_I3C_CTRL_NOTIFICATION_CR        | ibi_cr_tgt_addr
  */
typedef struct
{
  uint32_t dynamic_addr_valid; /*!< I3C target dynamic address validity (updated during ENTDAA/RSTDAA/SETNEWDA CCC)
                                    This parameter=1U after an ENTDAA or a SETNEWDA
                                    This parameter=0U after a RSTDAA */

  uint32_t dynamic_addr;       /*!< I3C target dynamic address (updated during ENTDAA/RSTDAA/SETNEWDA CCC)
                                    This parameter can be between Min_Data=0 and Max_Data=0x7F. */

  uint32_t  max_read_data_size_byte; /*!< Maximum read data length (in byte) that the target advertises to the
                                          Controller. Updated during SETMWL CCC.
                                          This parameter can be between Min_Data=0 and Max_Data=0xFFFF. */

  uint32_t  max_write_data_size_byte; /*!< Maximum write data length (in byte) that the target guarantees it
                                           can accept. Updated during SETMRL CCC.
                                           This parameter can be between Min_Data=0 and Max_Data=0xFFFF. */

  hal_i3c_reset_action_t reset_action;  /*!< I3C target reset action level (updated during RSTACT CCC) */

  hal_i3c_activity_state_t  activity_state;  /*!< I3C target activity state (updated during ENTASx CCC) */

  uint32_t hot_join_allowed;   /*!< I3C target Hot-Join (updated during ENEC/DISEC CCC)
                                    This parameter can be allowed=1U or not allowed=0U */

  uint32_t in_band_allowed;    /*!< I3C target in-band interrupt (updated during ENEC/DISEC CCC)
                                    This parameter can be allowed=1U or not allowed=0U */

  uint32_t ctrl_role_allowed;  /*!< I3C Target Controller-Role request permission (updated during ENEC/DISEC CCC).
                                    Value 1U => Target can request Controller role; 0U => not permitted. */

  uint32_t ibi_cr_tgt_addr;    /*!< I3C controller receives target address during IBI or Controller-Role request event
                                    This parameter can be between Min_Data=0 to Max_Data=0x3F */

  uint32_t ibi_tgt_nb_payload; /*!< I3C controller gets the number of data payload bytes after an IBI event
                                    This parameter can be between Min_Data=0 to Max_Data=0x7 */

  uint32_t ibi_tgt_payload;    /*!< I3C controller receives IBI payload after an IBI event
                                    Content of register is filled in Little Endian:
                                     - The MSB corresponds to the last IBI data byte,
                                     - LSB corresponds to first IBI data byte.
                                    This parameter can be between  Min_Data=0 to Max_Data=0xFFFFFFFF  */
} hal_i3c_ccc_info_t;

/**
  * @brief HAL I3C instance.
  */
typedef enum
{
  HAL_I3C1 = I3C1_BASE, /*!< Peripheral instance I3C1 */
} hal_i3c_t;

typedef struct hal_i3c_handle_s hal_i3c_handle_t; /*!< I3C handle structure type */

#if defined(USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)

/**
  * @brief Pointer to an I3C callback function.
  */
typedef  void (*hal_i3c_cb_t)(hal_i3c_handle_t *hi3c);

/**
  * @brief Pointer to an I3C notification callback function.
  */
typedef  void (*hal_i3c_notify_cb_t)(hal_i3c_handle_t *hi3c, uint32_t notify_id);

/**
  * @brief Pointer to an I3C target Hot-Join callback function.
  */
typedef  void (*hal_i3c_tgt_hot_join_cb_t)(hal_i3c_handle_t *hi3c, uint8_t dynamic_address);

/**
  * @brief Pointer to a target request dynamic address I3C callback function.
  */
typedef  void (*hal_i3c_req_dyn_addr_cb_t)(hal_i3c_handle_t *hi3c, uint64_t target_payload);

#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */

/**
  * @brief    I3C handle structure definition.
  */
struct hal_i3c_handle_s
{
  hal_i3c_t instance;         /*!< Peripheral instance */
  hal_i3c_mode_t mode;        /*!< Communication mode */
  uint32_t listen;            /*!< Listen mode */
  volatile hal_i3c_state_t global_state;  /*!< Communication state */
#if (defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)) \
    || (defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1))
  volatile uint32_t last_error_codes;  /*!< Errors limited to the last process
                                            This parameter can be a combination of @ref I3C_ERROR_CODE_DEFINITION */
#endif /* USE_HAL_I3C_GET_LAST_ERRORS || USE_HAL_I3C_DMA */
  const uint32_t *p_tc_data;  /*!< Transmit Control descriptor buffer */
  const uint8_t *p_tx_data;   /*!< Transmit data buffer */
  uint8_t *p_rx_data;         /*!< Receive data buffer */
  uint32_t tc_count_word;     /*!< Remaining control descriptor to transmit in word */
  uint32_t data_size_byte;    /*!< Data size to transmit or receive in byte */
  uint32_t tx_count_byte;     /*!< Remaining data to transmit in byte */
  uint32_t rx_count_byte;     /*!< Remaining data to receive in byte */
  hal_status_t(*p_isr_func)(hal_i3c_handle_t *hi3c, uint32_t it_masks); /*!< Dynamically selected IRQ handler for
                                   the current transfer/use case. Updated at operation start to route interrupts
                                   to the appropriate optimized routine */
  void(*p_tx_func)(hal_i3c_handle_t *hi3c);  /*!< Transmit function pointer */
  void(*p_rx_func)(hal_i3c_handle_t *hi3c);  /*!< Receive function pointer */

#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
  hal_dma_handle_t *hdma_tc;  /*!< Transmit Control descriptor DMA handle (Controller side only) */
  hal_dma_handle_t *hdma_tx;  /*!< Transmit data DMA handle */
  hal_dma_handle_t *hdma_rx;  /*!< Receive data DMA handle */
#endif /* USE_HAL_I3C_DMA */

#if defined(USE_HAL_I3C_USER_DATA) && (USE_HAL_I3C_USER_DATA == 1)
  const void *p_user_data;  /*!< User data pointer */
#endif /* USE_HAL_I3C_USER_DATA */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  hal_os_semaphore_t semaphore;  /*!< OS semaphore */
#endif /* USE_HAL_MUTEX */

#if defined(USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
  hal_i3c_notify_cb_t       p_notify_cb;         /*!< Target/Controller asynchronous events callback */
  hal_i3c_cb_t              p_error_cb;          /*!< Target/Controller error callback */
  hal_i3c_cb_t              p_abort_cplt_cb;     /*!< Target/Controller abort complete callback */
  hal_i3c_cb_t              p_ctrl_daa_cplt_cb;  /*!< Controller Dynamic Address Assignment completed callback */
  hal_i3c_cb_t              p_ctrl_transfer_cplt_cb; /*!< Controller multiple direct CCC, I3C private or I2C transfer
                                                      completed callback */
  hal_i3c_req_dyn_addr_cb_t p_ctrl_tgt_req_dyn_addr_cb; /*!< Controller gets target dynamic address request
                                                      during DAA process */
  hal_i3c_cb_t              p_tgt_tx_cplt_cb;    /*!< Target private data transmit transfer completed callback */
  hal_i3c_cb_t              p_tgt_rx_cplt_cb;    /*!< Target private data receive transfer completed callback */
  hal_i3c_tgt_hot_join_cb_t p_tgt_hot_join_cb;   /*!< Target Hot-Join callback */
#endif  /* USE_HAL_I3C_REGISTER_CALLBACKS */
};

/**
  * @}
  */

