MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.h
/* Exported macro ----------------------------------------------------------------------------------------------------*/
/** @defgroup I3C_Exported_Macros HAL I3C Macros
  * @{
  */

/**
  * @brief  Compute required control buffer size in word for a transfer context.
  * @param  NB_DESC  Number of descriptions used to build the transfer context
  * @param  MODE     Mode of the transfer used to build transfer context See @ref hal_i3c_transfer_mode_t
  * @retval 2*NB_DESC in case of direct CCC transfers or NB_DESC for all other transfers
  */
#define HAL_I3C_GET_CTRL_BUFFER_SIZE_WORD(NB_DESC, MODE) \
  (((MODE & LL_I3C_CONTROLLER_MTYPE_DIRECT) == LL_I3C_CONTROLLER_MTYPE_DIRECT) ? (2U * NB_DESC) : NB_DESC)

/**
  * @brief  Extract the 48-bit Provisional ID (PID) from an ENTDAA payload.
  * @param  PAYLOAD Raw ENTDAA payload (up to 64 bits) containing the PID in bits [47:0].
  * @return 48-bit PID value (upper bits [63:48] forced to 0).
  */
#define HAL_I3C_GET_PID(PAYLOAD) ((uint64_t)(PAYLOAD) & LL_I3C_PID_IN_PAYLOAD_MASK)

/**
  * @brief  Extract MIPI Manufacturer (Vendor) ID from PID.
  * @param  PID Provisional ID (bits [47:0]).
  * @return Vendor ID field (bits [47:33], width 15 bits).
  */
#define HAL_I3C_GET_MIPIMID(PID) ((uint16_t)((uint64_t)(PID) >> LL_I3C_MIPIMID_PID_SHIFT) & LL_I3C_MIPIMID_PID_MASK)

/**
  * @brief  Extract Type selector (bit) from PID (bits 32).
  * @param  PID Provisional ID.
  * @return Type selector bit value 0 or 1.
  */
#define HAL_I3C_GET_IDTSEL(PID) ((uint8_t)((uint64_t)(PID) >> LL_I3C_IDTSEL_PID_SHIFT) &  LL_I3C_IDTSEL_PID_MASK)

/**
  * @brief  Extract Part ID from PID (bits [31:16], width 16 bits).
  * @param  PID Provisional ID.
  * @return Part ID.
  */
#define HAL_I3C_GET_PART_ID(PID) ((uint16_t)((uint64_t)(PID) >> LL_I3C_PART_ID_PID_SHIFT) & LL_I3C_PART_ID_PID_MASK)

/**
  * @brief  Extract Instance ID (device instance) from PID (bits [15:12], width 4 bits).
  * @param  PID Provisional ID.
  * @return Instance ID.
  */
#define HAL_I3C_GET_MIPIID(PID) ((uint8_t)((uint64_t)(PID) >> LL_I3C_MIPIID_PID_SHIFT) & LL_I3C_MIPIID_PID_MASK)

/**
  * @brief  Extract DCR (Device Characteristics Register) from ENTDAA payload (bits [63:56], width 8 bits).
  * @param  PAYLOAD Raw ENTDAA payload.
  * @return DCR .
  */
#define HAL_I3C_GET_DCR(PAYLOAD) (((uint32_t)((uint64_t)(PAYLOAD) >> LL_I3C_DCR_IN_PAYLOAD_SHIFT)) & I3C_DCR_DCR)

/**
  * @brief  Extract BCR (Bus Characteristics Register) from ENTDAA payload (bits [55:48], width 8 bits).
  * @param  PAYLOAD Raw ENTDAA payload.
  * @return BCR .
  */
#define HAL_I3C_GET_BCR(PAYLOAD) (((uint32_t)((uint64_t)(PAYLOAD) >> LL_I3C_BCR_IN_PAYLOAD_SHIFT)) \
                                  & LL_I3C_BCR_BCR_MSK)

/**
  * @brief  Extract max data speed limitation flag from BCR (bit 0).
  * @param  BCR BCR byte.
  * @retval HAL_I3C_MAX_SPEED_LIMITATION_ENABLED or HAL_I3C_MAX_SPEED_LIMITATION_DISABLED.
  */
#define HAL_I3C_GET_MAX_DATA_SPEED_LIMIT(BCR) ((hal_i3c_max_speed_limitation_status_t)(uint32_t)((BCR) \
                                               & LL_I3C_BCR_BCR0_MSK))

/**
  * @brief  Extract In-Band Interrupt (IBI) request capability flag from BCR (bit 1).
  * @param  BCR BCR byte.
  * @retval HAL_I3C_IBI_REQ_ENABLED or HAL_I3C_IBI_REQ_DISABLED.
 */
#define HAL_I3C_GET_IBI_CAPABLE(BCR) ((hal_i3c_ibi_req_status_t)(uint32_t)((BCR) & LL_I3C_BCR_BCR1_MSK))

/**
  * @brief  Extract IBI additional data payload capability flag from BCR (bit 2).
  * @param  BCR BCR byte.
  * @retval HAL_I3C_IBI_PAYLOAD_ENABLED or HAL_I3C_IBI_PAYLOAD_DISABLED.
  */
#define HAL_I3C_GET_IBI_PAYLOAD(BCR) ((hal_i3c_ibi_payload_status_t)(uint32_t)((BCR) & LL_I3C_BCR_BCR2_MSK))

/**
  * @brief  Extract Offline Capable flag from BCR (bit 3).
  * @param  BCR BCR byte.
  * @retval HAL_I3C_OFFLINE_CAPABLE_ENABLED or HAL_I3C_OFFLINE_CAPABLE_DISABLED.
  */
#define HAL_I3C_GET_OFFLINE_CAPABLE(BCR) ((hal_i3c_offline_capable_status_t)(uint32_t)((BCR) & LL_I3C_BCR_BCR3_MSK))

/**
  * @brief  Extract Virtual Target support flag from BCR (bit 4).
  * @param  BCR BCR byte.
  * @retval HAL_I3C_VIRTUAL_TGT_ENABLED or HAL_I3C_VIRTUAL_TGT_DISABLED.
  */
#define HAL_I3C_GET_VIRTUAL_TGT(BCR) ((hal_i3c_virtual_tgt_status_t)(uint32_t)((BCR) & LL_I3C_BCR_BCR4_MSK))

/**
  * @brief  Extract advanced capabilities flag from BCR (bit 5).
  * @param  BCR BCR byte.
  * @retval HAL_I3C_ADV_CAPABILITIES_ENABLED or HAL_I3C_ADV_CAPABILITIES_DISABLED.
  */
#define HAL_I3C_GET_ADVANCED_CAPABLE(BCR) ((hal_i3c_adv_capabilities_status_t)(uint32_t)((BCR) & LL_I3C_BCR_BCR5_MSK))

/**
  * @brief  Extract Controller-Role request capability flag from BCR (bit 6).
  * @param  BCR BCR byte.
  * @retval HAL_I3C_CTRL_ROLE_ENABLED or HAL_I3C_CTRL_ROLE_DISABLED.
  */
#define HAL_I3C_GET_CTRL_ROLE_CAPABLE(BCR) ((hal_i3c_ctrl_role_status_t)(uint32_t)((BCR) & LL_I3C_BCR_BCR6_MSK))

/** @brief  Change uint32_t variable form big endian to little endian.
  * @param  DATA uint32_t variable in big endian
  *         This parameter must be a number between Min_Data=0x00(uint32_t) and Max_Data=0xFFFFFFFF
  * @return uint32_t variable in little endian
  */
#define HAL_I3C_BIG_TO_LITTLE_ENDIAN(DATA) ((uint32_t)((((DATA) & 0xff000000U) >> 24) \
                                                       | (((DATA) & 0x00ff0000U) >> 8) \
                                                       | (((DATA) & 0x0000ff00U) << 8) \
                                                       | (((DATA) & 0x000000ffU) << 24)))

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup I3C_Exported_Functions HAL I3C Functions
  * @{
  */

/** @addtogroup I3C_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */
hal_status_t HAL_I3C_Init(hal_i3c_handle_t *hi3c, hal_i3c_t instance);
void HAL_I3C_DeInit(hal_i3c_handle_t *hi3c);
/**
  * @}
  */

/** @defgroup I3C_Exported_Functions_Group2 Configuration functions
  * @{
  */

/* Global configuration */
/* Global configuration (controller) */
hal_status_t HAL_I3C_CTRL_SetConfig(hal_i3c_handle_t *hi3c, const hal_i3c_ctrl_config_t *p_config);
void HAL_I3C_CTRL_GetConfig(const hal_i3c_handle_t *hi3c, hal_i3c_ctrl_config_t *p_config);

/* Global configuration (target) */
hal_status_t HAL_I3C_TGT_SetConfig(hal_i3c_handle_t *hi3c, const hal_i3c_tgt_config_t *p_config);
void HAL_I3C_TGT_GetConfig(const hal_i3c_handle_t *hi3c, hal_i3c_tgt_config_t *p_config);

/* Payload ENTDAA configuration (target) */
hal_status_t HAL_I3C_TGT_SetPayloadENTDAAConfig(const hal_i3c_handle_t *hi3c,
                                                const hal_i3c_tgt_config_payload_entdaa_t *p_config);
void HAL_I3C_TGT_GetPayloadENTDAAConfig(const hal_i3c_handle_t *hi3c, hal_i3c_tgt_config_payload_entdaa_t *p_config);

