MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.h
/* FIFO configuration (controller) */
hal_status_t HAL_I3C_CTRL_SetConfigFifo(const hal_i3c_handle_t *hi3c, const hal_i3c_ctrl_fifo_config_t *p_config);
void HAL_I3C_CTRL_GetConfigFifo(const hal_i3c_handle_t *hi3c, hal_i3c_ctrl_fifo_config_t *p_config);

/* FIFO configuration (target) */
hal_status_t HAL_I3C_TGT_SetConfigFifo(const hal_i3c_handle_t *hi3c, const hal_i3c_tgt_fifo_config_t *p_config);
void HAL_I3C_TGT_GetConfigFifo(const hal_i3c_handle_t *hi3c, hal_i3c_tgt_fifo_config_t *p_config);

/* FIFO configuration unitary functions */
hal_status_t HAL_I3C_SetRxFifoThreshold(const hal_i3c_handle_t *hi3c, const hal_i3c_rx_fifo_threshold_t threshold);
hal_i3c_rx_fifo_threshold_t HAL_I3C_GetRxFifoThreshold(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_SetTxFifoThreshold(const hal_i3c_handle_t *hi3c, const hal_i3c_tx_fifo_threshold_t threshold);
hal_i3c_tx_fifo_threshold_t HAL_I3C_GetTxFifoThreshold(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_CTRL_EnableControlFifo(hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_CTRL_DisableControlFifo(hal_i3c_handle_t *hi3c);
hal_i3c_control_fifo_status_t HAL_I3C_CTRL_IsEnabledControlFifo(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_CTRL_EnableStatusFifo(hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_CTRL_DisableStatusFifo(hal_i3c_handle_t *hi3c);
hal_i3c_status_fifo_status_t HAL_I3C_CTRL_IsEnabledStatusFifo(const hal_i3c_handle_t *hi3c);

/* Own dynamic address (controller) */
hal_status_t HAL_I3C_CTRL_SetConfigOwnDynamicAddress(hal_i3c_handle_t *hi3c, uint32_t dynamic_address);
uint32_t HAL_I3C_CTRL_GetConfigOwnDynamicAddress(const hal_i3c_handle_t *hi3c);

/* Hot-Join allowed (controller) */
hal_status_t HAL_I3C_CTRL_EnableHotJoinAllowed(hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_CTRL_DisableHotJoinAllowed(hal_i3c_handle_t *hi3c);
hal_i3c_hot_join_status_t HAL_I3C_CTRL_IsEnabledHotJoinAllowed(const hal_i3c_handle_t *hi3c);

/* High keeper SDA configuration (controller) */
hal_status_t HAL_I3C_CTRL_EnableHighKeeperSDA(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_CTRL_DisableHighKeeperSDA(const hal_i3c_handle_t *hi3c);
hal_i3c_high_keeper_sda_status_t HAL_I3C_CTRL_IsEnabledHighKeeperSDA(const hal_i3c_handle_t *hi3c);

/* Stall time configuration (controller) */
hal_status_t HAL_I3C_CTRL_SetConfigStallTime(const hal_i3c_handle_t *hi3c, uint32_t stall_time_cycle,
                                             uint32_t stall_features);
hal_status_t HAL_I3C_CTRL_GetConfigStallTime(const hal_i3c_handle_t *hi3c, uint32_t *stall_time_cycle,
                                             uint32_t *stall_features);

/* Controller-Role request configuration (target) */
hal_status_t HAL_I3C_TGT_EnableCtrlRoleRequest(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_TGT_DisableCtrlRoleRequest(const hal_i3c_handle_t *hi3c);
hal_i3c_tgt_ctrl_role_status_t HAL_I3C_TGT_IsEnabledCtrlRoleRequest(const hal_i3c_handle_t *hi3c);

hal_status_t HAL_I3C_TGT_EnableHandOffDelay(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_TGT_DisableHandOffDelay(const hal_i3c_handle_t *hi3c);
hal_i3c_handoff_delay_status_t HAL_I3C_TGT_IsEnabledHandOffDelay(const hal_i3c_handle_t *hi3c);

/* Group management support configuration (target) */
hal_status_t HAL_I3C_TGT_EnableGroupAddrCapability(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_TGT_DisableGroupAddrCapability(const hal_i3c_handle_t *hi3c);
hal_i3c_grp_addr_capability_status_t HAL_I3C_TGT_IsEnabledGroupAddrCapability(const hal_i3c_handle_t *hi3c);

/* Hot-Join configuration (target) */
hal_status_t HAL_I3C_TGT_EnableHotJoinRequest(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_TGT_DisableHotJoinRequest(const hal_i3c_handle_t *hi3c);
hal_i3c_hot_join_status_t HAL_I3C_TGT_IsEnabledHotJoinRequest(const hal_i3c_handle_t *hi3c);

/* IBI configuration (target) */
hal_status_t HAL_I3C_TGT_SetConfigIBI(const hal_i3c_handle_t *hi3c, const hal_i3c_tgt_ibi_config_t *p_config);
void HAL_I3C_TGT_GetConfigIBI(const hal_i3c_handle_t *hi3c, hal_i3c_tgt_ibi_config_t *p_config);
hal_status_t HAL_I3C_TGT_EnableIBI(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_TGT_DisableIBI(const hal_i3c_handle_t *hi3c);
hal_i3c_tgt_ibi_status_t HAL_I3C_TGT_IsEnabledIBI(const hal_i3c_handle_t *hi3c);

/* Max data size configuration (target) */
hal_status_t HAL_I3C_TGT_SetConfigMaxDataSize(const hal_i3c_handle_t *hi3c, uint32_t max_read_data_size_byte,
                                              uint32_t max_write_data_size_byte);
hal_status_t HAL_I3C_TGT_GetConfigMaxDataSize(const hal_i3c_handle_t *hi3c, uint32_t *p_max_read_data_size_byte,
                                              uint32_t *p_max_write_data_size_byte);

/* GET MaX Data Speed (GETMXDS) configuration (target) */
hal_status_t HAL_I3C_TGT_SetConfigGETMXDS(const hal_i3c_handle_t *hi3c, const hal_i3c_tgt_getmxds_config_t *p_config);
void HAL_I3C_TGT_GetConfigGETMXDS(const hal_i3c_handle_t *hi3c, hal_i3c_tgt_getmxds_config_t *p_config);
/* GET MaX Data Speed (GETMXDS) unitary functions */
hal_status_t HAL_I3C_TGT_SetConfigGETMXDS_Format(const hal_i3c_handle_t *hi3c, hal_i3c_getmxds_format_t format);
hal_i3c_getmxds_format_t HAL_I3C_TGT_GetConfigGETMXDS_Format(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_TGT_SetConfigCtrlHandOffActivity(const hal_i3c_handle_t *hi3c,
                                                      hal_i3c_handoff_activity_state_t state);
hal_i3c_handoff_activity_state_t HAL_I3C_TGT_GetConfigCtrlHandOffActivity(const hal_i3c_handle_t *hi3c);

/* Bus device configuration configuration (controller) */
hal_status_t HAL_I3C_CTRL_SetConfigBusDevices(const hal_i3c_handle_t *hi3c, const hal_i3c_ctrl_device_config_t *p_desc,
                                              uint32_t nb_device);
void HAL_I3C_CTRL_GetConfigBusDevices(const hal_i3c_handle_t *hi3c, hal_i3c_ctrl_device_config_t *p_desc,
                                      uint32_t nb_device);

/* Reset pattern configuration (controller) */
hal_status_t HAL_I3C_CTRL_EnableResetPattern(hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_CTRL_DisableResetPattern(hal_i3c_handle_t *hi3c);
hal_i3c_reset_pattern_status_t HAL_I3C_CTRL_IsEnabledResetPattern(const hal_i3c_handle_t *hi3c);

#if defined(USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
/* Register callbacks */
hal_status_t HAL_I3C_CTRL_RegisterTransferCpltCallback(hal_i3c_handle_t *hi3c, hal_i3c_cb_t p_callback);
hal_status_t HAL_I3C_CTRL_RegisterDAACpltCallback(hal_i3c_handle_t *hi3c, hal_i3c_cb_t p_callback);
hal_status_t HAL_I3C_CTRL_RegisterTgtReqDynAddrCallback(hal_i3c_handle_t *hi3c,
                                                        hal_i3c_req_dyn_addr_cb_t p_callback);
hal_status_t HAL_I3C_TGT_RegisterTxCpltCallback(hal_i3c_handle_t *hi3c, hal_i3c_cb_t p_callback);
hal_status_t HAL_I3C_TGT_RegisterRxCpltCallback(hal_i3c_handle_t *hi3c, hal_i3c_cb_t p_callback);
hal_status_t HAL_I3C_TGT_RegisterHotJoinCallback(hal_i3c_handle_t *hi3c, hal_i3c_tgt_hot_join_cb_t p_callback);
hal_status_t HAL_I3C_RegisterNotifyCallback(hal_i3c_handle_t *hi3c, hal_i3c_notify_cb_t p_callback);
hal_status_t HAL_I3C_RegisterAbortCpltCallback(hal_i3c_handle_t *hi3c, hal_i3c_cb_t p_callback);
hal_status_t HAL_I3C_RegisterErrorCallback(hal_i3c_handle_t *hi3c, hal_i3c_cb_t p_callback);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */

#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
hal_status_t HAL_I3C_SetTxDMA(hal_i3c_handle_t *hi3c, hal_dma_handle_t *hdma);
hal_status_t HAL_I3C_SetRxDMA(hal_i3c_handle_t *hi3c, hal_dma_handle_t *hdma);
hal_status_t HAL_I3C_SetTcDMA(hal_i3c_handle_t *hi3c, hal_dma_handle_t *hdma);
#endif /* USE_HAL_I3C_DMA */
/**
  * @}
  */

/** @addtogroup I3C_Exported_Functions_Group3 Interrupt and callback functions
  * @{
  */
hal_status_t HAL_I3C_CTRL_ActivateNotification(hal_i3c_handle_t *hi3c, uint32_t notifications);
hal_status_t HAL_I3C_CTRL_DeactivateNotification(hal_i3c_handle_t *hi3c, uint32_t notifications);
hal_status_t HAL_I3C_TGT_ActivateNotification(hal_i3c_handle_t *hi3c, uint8_t *p_data, uint32_t size_byte,
                                              uint32_t notifications);
hal_status_t HAL_I3C_TGT_DeactivateNotification(hal_i3c_handle_t *hi3c, uint32_t notifications);
/**
  * @}
  */

/** @defgroup I3C_Exported_Functions_Group4 IRQ Handlers
  * @{
  */
void HAL_I3C_ERR_IRQHandler(hal_i3c_handle_t *hi3c);
void HAL_I3C_EV_IRQHandler(hal_i3c_handle_t *hi3c);
/**
  * @}
  */

/** @defgroup I3C_Exported_Functions_Group5 FIFO flush functions
  * @{
  */
hal_status_t HAL_I3C_FlushAllFifos(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_FlushTxFifo(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_FlushRxFifo(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_CTRL_FlushControlFifo(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_CTRL_FlushStatusFifo(const hal_i3c_handle_t *hi3c);
/**
  * @}
  */

