MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.h
/** @defgroup I3C_Exported_Functions_Group6 Controller transfer operation functions
  * @{
  */
/* Controller transfer operation */
hal_status_t HAL_I3C_CTRL_ResetTransferCtx(hal_i3c_transfer_ctx_t *p_ctx);
hal_status_t HAL_I3C_CTRL_InitTransferCtxTc(hal_i3c_transfer_ctx_t *p_ctx, uint32_t *p_ctrl_buf,
                                            uint32_t size_word);
hal_status_t HAL_I3C_CTRL_InitTransferCtxTx(hal_i3c_transfer_ctx_t *p_ctx, const uint8_t *p_tx_data,
                                            uint32_t size_byte);
hal_status_t HAL_I3C_CTRL_InitTransferCtxRx(hal_i3c_transfer_ctx_t *p_ctx, uint8_t *p_rx_data,
                                            uint32_t size_byte);

hal_status_t HAL_I3C_CTRL_BuildTransferCtxPrivate(hal_i3c_transfer_ctx_t *p_ctx, const hal_i3c_private_desc_t *p_desc,
                                                  uint32_t nb_desc, hal_i3c_transfer_mode_t mode);
hal_status_t HAL_I3C_CTRL_BuildTransferCtxCCC(hal_i3c_transfer_ctx_t *p_ctx, const hal_i3c_ccc_desc_t *p_desc,
                                              uint32_t nb_desc, hal_i3c_transfer_mode_t mode);
hal_status_t HAL_I3C_CTRL_Transfer(hal_i3c_handle_t *hi3c, const hal_i3c_transfer_ctx_t *p_ctx, uint32_t timeout_ms);
hal_status_t HAL_I3C_CTRL_Transfer_IT(hal_i3c_handle_t *hi3c, const hal_i3c_transfer_ctx_t *p_ctx);
#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
hal_status_t HAL_I3C_CTRL_Transfer_DMA(hal_i3c_handle_t *hi3c, const hal_i3c_transfer_ctx_t *p_ctx);
#endif /* USE_HAL_I3C_DMA */

/* Controller assign dynamic address APIs */
hal_status_t HAL_I3C_CTRL_SetDynAddr(const hal_i3c_handle_t *hi3c, uint8_t target_address);
hal_status_t HAL_I3C_CTRL_DynAddrAssign_IT(hal_i3c_handle_t *hi3c, hal_i3c_dyn_addr_opt_t option);
hal_status_t HAL_I3C_CTRL_DynAddrAssign(hal_i3c_handle_t *hi3c, uint64_t *p_target_payload,
                                        hal_i3c_dyn_addr_opt_t option,
                                        hal_i3c_target_detection_status_t *p_target_detection_status,
                                        uint32_t timeout_ms);

/* Controller check device ready APIs */
hal_status_t HAL_I3C_CTRL_PoolForDeviceI3cReady(hal_i3c_handle_t *hi3c, uint8_t target_address, uint32_t timeout_ms);
hal_status_t HAL_I3C_CTRL_PoolForDeviceI2cReady(hal_i3c_handle_t *hi3c, uint8_t target_address, uint32_t timeout_ms);
/* Controller patterns APIs */
hal_status_t HAL_I3C_CTRL_GeneratePatterns(hal_i3c_handle_t *hi3c, hal_i3c_pattern_opt_t pattern, uint32_t timeout_ms);

/* Controller arbitration API */
hal_status_t HAL_I3C_CTRL_GenerateArbitration(hal_i3c_handle_t *hi3c, uint32_t timeout_ms);

/* Controller stop SCL API in case of CE1 error */
hal_status_t HAL_I3C_CTRL_RecoverSCLToIDLE(const hal_i3c_handle_t *hi3c);
/**
  * @}
  */

/** @defgroup I3C_Exported_Functions_Group7 Target operational functions
  * @{
  */
hal_status_t HAL_I3C_TGT_Transmit(hal_i3c_handle_t *hi3c, const uint8_t *p_data, uint32_t size_byte,
                                  uint32_t timeout_ms);
hal_status_t HAL_I3C_TGT_Transmit_IT(hal_i3c_handle_t *hi3c, const uint8_t *p_data, uint32_t size_byte);
#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
hal_status_t HAL_I3C_TGT_Transmit_DMA(hal_i3c_handle_t *hi3c, const uint8_t *p_data, uint32_t size_byte);
#endif /* USE_HAL_I3C_DMA */
hal_status_t HAL_I3C_TGT_Receive(hal_i3c_handle_t *hi3c, uint8_t *p_data, uint32_t size_byte, uint32_t timeout_ms);
hal_status_t HAL_I3C_TGT_Receive_IT(hal_i3c_handle_t *hi3c, uint8_t *p_data, uint32_t size_byte);
#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
hal_status_t HAL_I3C_TGT_Receive_DMA(hal_i3c_handle_t *hi3c, uint8_t *p_data, uint32_t size_byte);
#endif /* USE_HAL_I3C_DMA */
hal_status_t HAL_I3C_TGT_ControlRoleReq(hal_i3c_handle_t *hi3c, uint32_t timeout_ms);
hal_status_t HAL_I3C_TGT_ControlRoleReq_IT(hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_TGT_HotJoinReq(hal_i3c_handle_t *hi3c, uint8_t *p_own_dynamic_address, uint32_t timeout_ms);
hal_status_t HAL_I3C_TGT_HotJoinReq_IT(hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_TGT_IBIReq(hal_i3c_handle_t *hi3c, const uint8_t *p_payload, uint32_t payload_size_byte,
                                uint32_t timeout_ms);
hal_status_t HAL_I3C_TGT_IBIReq_IT(hal_i3c_handle_t *hi3c, const uint8_t *p_payload, uint32_t payload_size_byte);
/**
  * @}
  */

/** @defgroup I3C_Exported_Functions_Group8 Weak callback functions
  * @{
  */
void HAL_I3C_CTRL_TransferCpltCallback(hal_i3c_handle_t *hi3c);
void HAL_I3C_CTRL_DAACpltCallback(hal_i3c_handle_t *hi3c);
void HAL_I3C_CTRL_TgtReqDynAddrCallback(hal_i3c_handle_t *hi3c, uint64_t target_payload);
void HAL_I3C_TGT_TxCpltCallback(hal_i3c_handle_t *hi3c);
void HAL_I3C_TGT_RxCpltCallback(hal_i3c_handle_t *hi3c);
void HAL_I3C_TGT_HotJoinCallback(hal_i3c_handle_t *hi3c, uint8_t dynamic_address);
void HAL_I3C_NotifyCallback(hal_i3c_handle_t *hi3c, uint32_t notify_id);
void HAL_I3C_ErrorCallback(hal_i3c_handle_t *hi3c);
void HAL_I3C_AbortCpltCallback(hal_i3c_handle_t *hi3c);
/**
  * @}
  */

/** @defgroup I3C_Exported_Functions_Group9 Generic and common functions
  * @{
  */
hal_i3c_state_t HAL_I3C_GetState(const hal_i3c_handle_t *hi3c);
hal_i3c_mode_t HAL_I3C_GetMode(const hal_i3c_handle_t *hi3c);
#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
uint32_t HAL_I3C_GetLastErrorCodes(const hal_i3c_handle_t *hi3c);
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
uint32_t HAL_I3C_GetClockFreq(const hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_Abort_IT(hal_i3c_handle_t *hi3c);
hal_status_t HAL_I3C_GetCCCInfo(const hal_i3c_handle_t *hi3c, uint32_t notifications, hal_i3c_ccc_info_t *p_ccc_info);
hal_status_t HAL_I3C_CTRL_GetENTDAA_PayloadInfo(uint64_t entdaa_payload, hal_i3c_entdaa_payload_t *p_entdaa_payload);
uint32_t HAL_I3C_GetDataCounter(hal_i3c_handle_t *hi3c);
/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @defgroup I3C_Exported_Functions_Group10 Acquire/release the bus
  * @{
  */
hal_status_t HAL_I3C_AcquireBus(hal_i3c_handle_t *hi3c, uint32_t timeout_ms);
hal_status_t HAL_I3C_ReleaseBus(hal_i3c_handle_t *hi3c);
/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

#if defined(USE_HAL_I3C_USER_DATA) && (USE_HAL_I3C_USER_DATA == 1)
/** @defgroup I3C_Exported_Functions_Group11 Set/get user data
  * @{
  */
void HAL_I3C_SetUserData(hal_i3c_handle_t *hi3c, const void *p_user_data);
const void *HAL_I3C_GetUserData(const hal_i3c_handle_t *hi3c);
/**
  * @}
  */
#endif /* USE_HAL_I3C_USER_DATA */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* I3C1 */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_HAL_I3C_H */
